### 4. 데이터프레임 데이터 조작

In [1]:
import numpy as np
import pandas as pd

- 데이터 갯수 세기

In [2]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [3]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [36]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [5]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [6]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

- 카테고리 값 세기

In [7]:
titanic['class'].value_counts()

class
Third     491
First     216
Second    184
Name: count, dtype: int64

In [8]:
np.random.seed = (2023)
df = pd.DataFrame(np.random.randint(40,101,size=(4,5)),
                    index = list('abcd'), columns = list('VWXYZ'))
df

    V   W    X   Y   Z
a  83  91   79  78  82
b  73  98  100  43  45
c  64  44   86  46  71
d  59  97   71  42  56

In [9]:
df.sort_values(by='V',ascending=False)

    V   W    X   Y   Z
a  83  91   79  78  82
b  73  98  100  43  45
c  64  44   86  46  71
d  59  97   71  42  56

In [10]:
# V 열에 동일한 값이 있으면, 동일한 같은 W 열을 보고 정렬
df2 = df.sort_values(by=['V','W'],ascending=False)
df2

    V   W    X   Y   Z
a  83  91   79  78  82
b  73  98  100  43  45
c  64  44   86  46  71
d  59  97   71  42  56

In [11]:
titanic = sns.load_dataset('titanic')
titanic
print(titanic['sex'].value_counts())
print(titanic['class'].value_counts())
print(titanic['alive'].value_counts())

sex
male      577
female    314
Name: count, dtype: int64
class
Third     491
First     216
Second    184
Name: count, dtype: int64
alive
no     549
yes    342
Name: count, dtype: int64

- 행과 열의 합계

In [12]:
df

    V   W    X   Y   Z
a  83  91   79  78  82
b  73  98  100  43  45
c  64  44   86  46  71
d  59  97   71  42  56

In [13]:
# 행방향 열의 합
df.sum(axis=0)

V    279
W    330
X    336
Y    209
Z    254
dtype: int64

In [14]:
# 열 방향 행의 합
df.sum(axis=1)

a    413
b    359
c    311
d    325
dtype: int64

In [15]:
# 총점 열
df['총점'] = df.sum(axis=1)
df

    V   W    X   Y   Z   총점
a  83  91   79  78  82  413
b  73  98  100  43  45  359
c  64  44   86  46  71  311
d  59  97   71  42  56  325

In [16]:
# 평균 열
df['평균'] = df[['V','W','X','Y','Z']].mean(axis=1)
df

    V   W    X   Y   Z   총점    평균
a  83  91   79  78  82  413  82.6
b  73  98  100  43  45  359  71.8
c  64  44   86  46  71  311  62.2
d  59  97   71  42  56  325  65.0

In [17]:
df['평균2'] = df.iloc[:,:5].mean(axis=1)
df

    V   W    X   Y   Z   총점    평균   평균2
a  83  91   79  78  82  413  82.6  82.6
b  73  98  100  43  45  359  71.8  71.8
c  64  44   86  46  71  311  62.2  62.2
d  59  97   71  42  56  325  65.0  65.0

In [18]:
# 행추가
df.loc['합계', :] = df.sum()
df

        V      W      X      Y      Z      총점     평균    평균2
a    83.0   91.0   79.0   78.0   82.0   413.0   82.6   82.6
b    73.0   98.0  100.0   43.0   45.0   359.0   71.8   71.8
c    64.0   44.0   86.0   46.0   71.0   311.0   62.2   62.2
d    59.0   97.0   71.0   42.0   56.0   325.0   65.0   65.0
합계  279.0  330.0  336.0  209.0  254.0  1408.0  281.6  281.6

In [19]:
titanic = sns.load_dataset('titanic')
titanic
round(titanic['age'].mean(), 2)

29.7

In [20]:
titanic[titanic.sex == 'female'].age.mean().round(2)

27.92

In [21]:
titanic[(titanic.pclass == 1)&(titanic.sex == 'female')].age.mean().round(2)

34.61

- apply 변환

In [22]:
df2

    V   W    X   Y   Z
a  83  91   79  78  82
b  73  98  100  43  45
c  64  44   86  46  71
d  59  97   71  42  56

In [23]:
# 각 열에서 최대값 - 최소값 한 결과
df2.apply(lambda x:x.max()-x.min())

V    24
W    54
X    29
Y    36
Z    37
dtype: int32

In [24]:
df.V.apply(lambda x: x*x)

a      6889.0
b      5329.0
c      4096.0
d      3481.0
합계    77841.0
Name: V, dtype: float64

In [32]:
titanic["adult/child"] = titanic.apply(lambda r: "adult" if r.age >= 20 else "child", axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [33]:
data = {'price':['1,200','2,500','3,300'],
            'text':['03.입출력.ipynb','04.고급인덱싱.ipynb','05.데이터프레임.ipynb']
}
df3 = pd.DataFrame(data)
df3

   price             text
0  1,200     03.입출력.ipynb
1  2,500   04.고급인덱싱.ipynb
2  3,300  05.데이터프레임.ipynb

In [34]:
df3['구둣점제거'] = df3.text.apply(lambda x: x.replace('.',''))
df3

   price             text          구둣점제거
0  1,200     03.입출력.ipynb     03입출력ipynb
1  2,500   04.고급인덱싱.ipynb   04고급인덱싱ipynb
2  3,300  05.데이터프레임.ipynb  05데이터프레임ipynb

In [30]:
# Series.str.replace(pat, repl, n=-1, case = None, flags=0, regex=None)
# pat: 문자열이나 정규표현식 / repel: 대체할 문자 / n: int,default(모든경우 변경)
# case: 대소문자 구분 True - 대소문자 구분 / False - 대소문자 구분x
# flags : int / regex: 정규표현식인지 결정 True: 정규표현식 False: 문자열
df3['한글제거'] = df3.구둣점제거.str.replace(pat='[ㄱ-ㅎㅏ-ㅣ가-힣]', repl= r'', regex=True)
df3

   price             text          구둣점제거     한글제거
0  1,200     03.입출력.ipynb     03입출력ipynb  03ipynb
1  2,500   04.고급인덱싱.ipynb   04고급인덱싱ipynb  04ipynb
2  3,300  05.데이터프레임.ipynb  05데이터프레임ipynb  05ipynb

In [35]:
df3['한글제거'] = df3.text.replace('[ㄱ-ㅎㅏ-ㅣ가-힣]','',regex=True)
df3

   price             text          구둣점제거       한글제거
0  1,200     03.입출력.ipynb     03입출력ipynb  03..ipynb
1  2,500   04.고급인덱싱.ipynb   04고급인덱싱ipynb  04..ipynb
2  3,300  05.데이터프레임.ipynb  05데이터프레임ipynb  05..ipynb

- 연습문제 4.4.5

In [29]:
titanic.apply(pd.value_counts).fillna(titanic.age.mean()).age

0        29.699118
0.42      1.000000
0.67      1.000000
0.75      2.000000
0.83      2.000000
           ...
male     29.699118
man      29.699118
no       29.699118
woman    29.699118
yes      29.699118
Name: age, Length: 329, dtype: float64

- 결측치 처리

In [63]:

dt = sns.load_dataset('titanic')

In [64]:
# 결측치 확인(열)
dt.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [65]:
# 결측치 확인(전체)
dt.isna().sum().sum()

869

In [66]:
# deck는 결측치가 너무 많아서 열을 삭제
# del dt['deck'] 
dt.drop(columns=['deck'], inplace=True)
dt.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True

In [67]:
# age 결측치는 평균으로 대체
dt.age.fillna(dt.age.mean(), inplace= True)
dt.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
886,0,2,male,27.000000,0,0,13.00,S,Second,man,True,Southampton,no,True
887,1,1,female,19.000000,0,0,30.00,S,First,woman,False,Southampton,yes,True
888,0,3,female,29.699118,1,2,23.45,S,Third,woman,False,Southampton,no,False
889,1,1,male,26.000000,0,0,30.00,C,First,man,True,Cherbourg,yes,True
890,0,3,male,32.000000,0,0,7.75,Q,Third,man,True,Queenstown,no,True

In [68]:
# embarked 결측치는 최빈값으로 대체
dt.embarked.fillna('S', inplace=True)
dt.embarked.value_counts()

embarked
S    646
C    168
Q     77
Name: count, dtype: int64

In [71]:
# embark_town의 결측치의 행 삭제
dt.dropna(subset=['embark_town'], inplace= True)
dt.isna().sum().sum()

0

In [72]:
dt.shape

(889, 14)

- astype

In [74]:
data = {
    'price': ['1200','24000','3600'],
    'price2': ['1,200','24,000','3,600']
}
df4 = pd.DataFrame(data)
df4

   price  price2
0   1200   1,200
1  24000  24,000
2   3600   3,600

In [76]:
type(df4.price[0]), type(df4.price2[0])

(str, str)

In [77]:
df4['int'] = df4.price.astype(int)

In [78]:
df4

   price  price2    int
0   1200   1,200   1200
1  24000  24,000  24000
2   3600   3,600   3600

In [80]:
type(df4.int[0])

numpy.int32

In [84]:
df4['int2'] = df4.price2.apply(lambda x:int(x.replace(',','')))
df4

   price  price2    int   int2
0   1200   1,200   1200   1200
1  24000  24,000  24000  24000
2   3600   3,600   3600   3600

- 실수값을 카테고리 값으로 변환

In [88]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '장년', '미성년자', '중년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [92]:
df5= pd.DataFrame(ages, columns=["ages"])
df5["age_cat"] = pd.cut(df5.ages, bins, labels=labels)
df5

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      중년
6     31      중년
7     61      장년
8     20    미성년자
9     41      중년
10    32      중년
11   101     NaN

In [93]:
df5['one_over_n'] = pd.qcut(ages, 4, labels=["Q1", "Q2", "Q3", "Q4"])
df5

    ages age_cat one_over_n
0      0     NaN         Q1
1      2    미성년자         Q1
2     10    미성년자         Q1
3     21      청년         Q2
4     23      청년         Q2
5     37      중년         Q3
6     31      중년         Q3
7     61      장년         Q4
8     20    미성년자         Q2
9     41      중년         Q4
10    32      중년         Q3
11   101     NaN         Q4